import { useNavigate } from 'react-router-dom';
import { Button } from 'reactstrap';
import './AnnouncementBackground.css';

const Announcementpage2 = () => {
    const navigate = useNavigate();

  const back = () => {
    navigate('/')}
    return(
    <div className='bg'>
        <Button onClick={back}>back</Button>
        <tr>
          <td>
            <table>
                <h1 style={{ textAlign: 'center', fontSize: '20px', marginTop: '30px' }}>การแข่งขันพัฒนาโปรแกรมคอมพิวเตอร์แห่งประเทศไทย ครั้งที่ 24 (NSC 2022)</h1>
                <h2 style={{ textAlign: 'center', fontSize: '20px', marginTop: '30px' }}>รายชื่อโครงการที่ผ่านรับทุนรอบนำเสนอผลงาน ศูนย์ประสานงานภูมิภาค"ภาคใต้"</h2>
                <div style={{textAlign: 'center', justifyContent: 'center',}}>
                  <tr>
                    <th>ที่</th>
                    <th>รหัสโครงการ</th>
                    <th>โครงการ</th>
                    <th>หมวดโครงการ</th>
                    <th>ระดับ</th>
                    <th>สถาบัน</th>
                  </tr>
                  <tr>
                    <td>1</td>
                    <td>24p11s0078</td>
                    <td>NFT เกมเพื่อการเรียนรู้</td>
                    <td>โปรแกรมเพื่อการศึกษาและส่งเสริมการเรียนรู้</td>
                    <td>นิสิต นักศึกษา</td>
                    <td>มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตภูเก็ต</td>
                  </tr>
                  <tr>
                    <td>2</td>
                    <td>24p11s0098</td>
                    <td>สาคู แพลตฟอร์มบริหารจัดการชั้นเรียน</td>
                    <td>โปรแกรมเพื่อการศึกษาและส่งเสริมการเรียนรู้</td>
                    <td>นิสิต นักศึกษา</td>
                    <td>มหาวิทยาลัยสงขลานครินทร์</td>
                  </tr>
                  <tr>
                    <td>3</td>
                    <td>24p12s0033</td>
                    <td>การพัฒนาเครื่องช่วยเหลือการใช้งาน WRF-CHEM เพื่อการจาลองการเคลื่อนที่ของอนุภาคฝุ่น PM2.5</td>
                    <td>โปรแกรมเพื่อบริหารการการเปลี่ยนแปลงสภาพภูมิอากาศและสิ่งแวดล้อม</td>
                    <td>นิสิต นักศึกษา</td>
                    <td>มหาวิทยาลัยสงขลานครินทร์</td>
                  </tr>
                  <tr>
                    <td>4</td>
                    <td>24p13s0079</td>
                    <td>PillTrack: ระบบติดตามการรับประทานยาเม็ดสาหรับผู้สูงอายุ</td>
                    <td>โปรแกรมเพื่อช่วยคนพิการและผู้สูงอายุ</td>
                    <td>นิสิต นักศึกษา</td>
                    <td>มหาวิทยาลัยสงขลานครินทร์</td>
                  </tr>
                  <tr>
                    <td>5</td>
                    <td>24p13s0116</td>
                    <td>เสียงสู่มือ</td>
                    <td>โปรแกรมเพื่อช่วยคนพิการและผู้สูงอายุ</td>
                    <td>นิสิต นักศึกษา</td>
                    <td>มหาวิทยาลัยสงขลานครินทร์</td>
                  </tr>
                  <tr>
                    <td>6</td>
                    <td>24p13s0117</td>
                    <td>สายรัดข้อมือเพื่อให้ความช่วยเหลือผู้สูงอายุและผู้พิการ</td>
                    <td>โปรแกรมเพื่อช่วยคนพิการและผู้สูงอายุ</td>
                    <td>นิสิต นักศึกษา</td>
                    <td>มหาวิทยาลัยสงขลานครินทร์</td>
                  </tr>
                  <tr>
                    <td>7</td>
                    <td>24p14s0066</td>
                    <td>พีคอด</td>
                    <td>โปรแกรมเพื่อใช้ภายใต้สถานการณ์โควิด-19 และโรคติดเชื้ออุบัติใหม่</td>
                    <td>นิสิต นักศึกษา</td>
                    <td>มหาวิทยาลัยสงขลานครินทร์ วิทยาเขตภูเก็ต</td>
                  </tr>
                  <tr>
                    <td>8</td>
                    <td>24p14s0103</td>
                    <td>GermyJunk: บริการค้นหาและวิเคราะห์จุดรับขยะปนเปื้อนโรคติดเชื้อไวรัสโคโรนา 2019 (COVID-19)</td>
                    <td>โปรแกรมเพื่อใช้ภายใต้สถานการณ์โควิด-19 และโรคติดเชื้ออุบัติใหม่</td>
                    <td>นิสิต นักศึกษา</td>
                    <td>มหาวิทยาลัยสงขลานครินทร์</td>
                  </tr>
                  <tr>
                    <td>9</td>
                    <td>24p21s0008</td>
                    <td>โครี่ พื้นฐานเกาหลีใน 4 สัปดาห์</td>
                    <td>โปรแกรมเพื่อการศึกษาและส่งเสริมการเรียนรู้</td>
                    <td>นักเรียน</td>
                    <td>โรงเรียนวิทยาศาสตร์จุฬาภรณราชวิทยาลัย ตรัง</td>
                  </tr>
                  <tr>
                    <td>10</td>
                    <td>24p21s0010</td>
                    <td>ย้อนเวลาศึกษาธรณีกาล</td>
                    <td>โปรแกรมเพื่อการศึกษาและส่งเสริมการเรียนรู้</td>
                    <td>นักเรียน</td>
                    <td>โรงเรียนวิทยาศาสตร์จุฬาภรณราชวิทยาลัย ตรัง</td>
                  </tr>
                  <tr>
                    <td>11</td>
                    <td>24p21s0014</td>
                    <td>Uclass: แอปพลิเคชั่นสำหรับห้องเรียนออนไลน์</td>
                    <td>โปรแกรมเพื่อการศึกษาและส่งเสริมการเรียนรู้</td>
                    <td>นักเรียน</td>
                    <td>โรงเรียนวิทยาศาสตร์จุฬาภรณราชวิทยาลัย ตรัง</td>
                  </tr>
                  <tr>
                    <td>12</td>
                    <td>24p21s0016</td>
                    <td>การทดลองสำหรับนักวิจัยฝึกหัด</td>
                    <td>โปรแกรมเพื่อการศึกษาและส่งเสริมการเรียนรู้</td>
                    <td>นักเรียน</td>
                    <td>โรงเรียนวิทยาศาสตร์จุฬาภรณราชวิทยาลัย ตรัง</td>
                  </tr>
                  <tr>
                    <td>13</td>
                    <td>24p21s0034</td>
                    <td>เกมเพื่อช่วยในการจดจำตารางธาตุ</td>
                    <td>โปรแกรมเพื่อการศึกษาและส่งเสริมการเรียนรู้</td>
                    <td>นักเรียน</td>
                    <td>โรงเรียนวิทยาศาสตร์จุฬาภรณราชวิทยาลัย นครศรีธรรมราช</td>
                  </tr>
                  <tr>
                    <td>14</td>
                    <td>24p21s0068</td>
                    <td>การพัฒนาเว็บแอพเรียนรู้ฟิสิกส์ด้วยตนเองโดยเรียนรู้จากการทดลองเสมือน และประเมินผลด้วย Bayes' theorem</td>
                    <td>โปรแกรมเพื่อการศึกษาและส่งเสริมการเรียนรู้</td>
                    <td>นักเรียน</td>
                    <td>โรงเรียนหาดใหญ่วิทยาลัย</td>
                  </tr>
                  <tr>
                    <td>15</td>
                    <td>24p21s0072</td>
                    <td>"อีจาล่า" แอปเพื่อการเรียนรู้</td>
                    <td>โปรแกรมเพื่อการศึกษาและส่งเสริมการเรียนรู้</td>
                    <td>นักเรียน</td>
                    <td>โรงเรียนวิทยาศาสตร์จุฬาภรณราชวิทยาลัย สตูล</td>
                  </tr>
                 </div>
            </table>
          </td>
        </tr>
    </div>
    )
};

export default Announcementpage2;